## Бабочка по функциям
## Автор: Калашков П.А. ИУ7-16Б
while True:
    b = 0
    x, y = map(float, input('Введите координаты точки: ').split())
    if -9 <= x <= -1: ## левые крылья
        ## левое верхнее крыло
        if y <= -1/8 * (x+9)**2 + 8 and ((x <= -8 and y >= 7*(x+8)**2 +1) or (-8 <= x <= -1 and y >= 1/49 * (x+1)**2)):
            print('Принадлежит, левое верхнее крыло')
            b = 1
        ## левое нижнее крыло
        elif (-8 <= x <=-2 and y >= -1/3 * (x+5)**2 - 7 and y <= -4/49 * (x+1)**2) or (-2 <= x <=-1 and y >=(-2) *(x+1)**2 -2 and y <= -4/49 * (x+1)**2):
            print('Принадлежит, левое нижнее крыло')
            b = 1
    if 1 <= x <= 9: ## правая часть
        ## правое верхнее крыло
        if (1 <= x <= 8 and y >= -1/49 * (x-1)**2 and y <= -1/8 * (x-9)**2 + 8) or (8 <= x <=9 and y >= 7* (x-8)**2 + 1 and y <= -1/8 * (x-9)**2 + 8):
            print('Принадлежит, правое верхнее крыло')
            b = 1
        ## правое нижнее крыло
        elif (1 <= x <= 2 and y >= (-2)*(x-1)**2 -2 and y <= -4/49 * (x-1)**2) or (2 <= x <= 9 and y >= -1/3 * (x-5)**2 -7 and y <= -4/49 * (x-1)**2):
            print('Принадлежит, правое нижнее крыло')
            b = 1
    if -1 <= x <= 1:
        ## пузико
        if y >= 4*x**2 - 6 and y <= -4 * x**2 + 2:
            print('Принадлежит, пузико')
            b = 1
    if -2 <= x <= 0 and y == -1.5*x + 2:
        ## левый усик
        print('Принадлежит, левый усик')
        b = 1
    if 0 <= x <= 2 and y == 1.5*x +2:
        ## правый усик
        print('Принадлежит, правый усик')
        b = 1
    if b == 0:
        print('Не принадлежит :(')
    b = 0
    print('Ещё разок?) Введите 1 или 0: ')
    a = float(input())
    if a == 0:
        print('Спасибо, что пользовались программой :)')
        break

